# Alcohol counter

### Introduction:

It is all about drinks and indexs.


### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import matplotlib

### Step 2. Import the dataset from this [address](http://bit.ly/drinksbycountry).

In [4]:
url = 'https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv'

### Step 3. Assign it to a variable called drinks

In [5]:
drinks = pd.read_csv(url, sep=',')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

### Step 4. Print the first 5 rows of the dataframe

In [10]:
#drinks.iloc[:, 1:5]
drinks.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [8]:
drinks.iloc[:, 1:5]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,0,0,0,0.0
1,89,132,54,4.9
2,25,0,14,0.7
3,245,138,312,12.4
4,217,57,45,5.9
...,...,...,...,...
188,333,100,3,7.7
189,111,2,1,2.0
190,6,0,0,0.1
191,32,19,4,2.5
192,64,18,4,4.7

### Step 5. Return the index

In [11]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [14]:
range(drinks.shape[1])

range(0, 6)

### Step 6. Identify what rows you are working with

In [15]:
drinks.shape

(193, 6)

### Step 7. Use .loc method to retrieve an element/cell

In [17]:
drinks.loc[1]

country                         Albania
beer_servings                        89
spirit_servings                     132
wine_servings                        54
total_litres_of_pure_alcohol        4.9
continent                        Europe
Name: 1, dtype: object

### Step 8. Use .iloc method to retrieve an element/cell

In [18]:
drinks.iloc[0]

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol            0.0
continent                              Asia
Name: 0, dtype: object

### Step 9. Set the index to 'country'

In [19]:
drinks.set_index("country", inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

### Step 10. Set a more complex index

### Step 11. Clear index name

In [24]:
drinks.index.name = None
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [28]:
#second solution
drinks= drinks.rename_axis(None, axis=1)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

### Step 12. Reset index name

In [30]:
drinks = drinks.reset_index().rename(columns={'index': 'country'})
drinks.head()

,country,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,Afghanistan,0,0,0,0.0,Asia
1,1,Albania,89,132,54,4.9,Europe
2,2,Algeria,25,0,14,0.7,Africa
3,3,Andorra,245,138,312,12.4,Europe
4,4,Angola,217,57,45,5.9,Africa

In [ ]:
#drinks = drinks.reset_index(inplace=True)
#drinks.head()

### Step 13. Use the index to select values from series

### Step 14. Sort based on values in the Series

### Bonus: Reindex to Align with Other Objects